{"class_name": "Sequential", "keras_version": "2.1.1", "config": [{"class_name": "Masking", "config": {"mask_value": -1, "batch_input_shape": [null, 12, 29], "name": "masking_1", "dtype": "float32", "trainable": true}}, {"class_name": "LSTM", "config": {"batch_input_shape": [null, 12, 29], "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "use_bias": true, "return_sequences": false, "activity_regularizer": null, "implementation": 1, "name": "lstm_1", "trainable": true, "kernel_constraint": null, "activation": "tanh", "return_state": false, "bias_regularizer": null, "unit_forget_bias": true, "bias_constraint": null, "unroll": false, "stateful": false, "recurrent_dropout": 0.0, "units": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "go_backwards": false, "dropout": 0.0}}, {"class_name": "Dense", "config": {"batch_input_shape": [null, 80], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "dtype": "float32", "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "activation": "linear", "units": 13, "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_1", "trainable": true}}], "backend": "tensorflow"}