{"keras_version": "2.1.1", "config": [{"config": {"batch_input_shape": [null, 12, 29], "name": "masking_1", "trainable": true, "mask_value": -1, "dtype": "float32"}, "class_name": "Masking"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 80, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "unroll": false, "bias_constraint": null, "name": "lstm_1", "recurrent_activation": "hard_sigmoid", "return_sequences": false, "recurrent_regularizer": null, "activation": "tanh", "bias_regularizer": null, "implementation": 1, "stateful": false, "use_bias": true, "dropout": 0.0, "recurrent_constraint": null, "kernel_constraint": null, "dtype": "float32", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 12, 29], "recurrent_dropout": 0.0, "go_backwards": false, "kernel_regularizer": null, "unit_forget_bias": true, "activity_regularizer": null, "return_state": false}, "class_name": "LSTM"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "units": 13, "name": "dense_1", "dtype": "float32", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 80], "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential"}